from sympy import symbols, Matrix

x, y, z = symbols('ρ λ μ')
A = Matrix(
    [[0, 0, 0, -1 / x, 0, 0, 0, 0, 0],
     [0, 0, 0, 0, -1 / x, 0, 0, 0, 0],
     [0, 0, 0, 0, 0, -1 / x, 0, 0, 0],
     [-(y + 2 * z), 0, 0, 0, 0, 0, 0, 0, 0],
     [0, -z, 0, 0, 0, 0, 0, 0, 0],
     [0, 0, -z, 0, 0, 0, 0, 0, 0],
     [-y, 0, 0, 0, 0, 0, 0, 0, 0],
     [0, 0, 0, 0, 0, 0, 0, 0, 0],
     [-y, 0, 0, 0, 0, 0, 0, 0, 0]])

for val in A.eigenvals():
    print(f'Собственное значение: {val}, кратность: {A.eigenvals()[val]}')
