from sympy import symbols, Matrix

x, y, z = symbols('ρ λ μ')
A = Matrix(
    [[0, 0, 0, -1 / x, 0, 0, 0, 0, 0],
     [0, 0, 0, 0, -1 / x, 0, 0, 0, 0],
     [0, 0, 0, 0, 0, -1 / x, 0, 0, 0],
     [-(y + 2 * z), 0, 0, 0, 0, 0, 0, 0, 0],
     [0, -z, 0, 0, 0, 0, 0, 0, 0],
     [0, 0, -z, 0, 0, 0, 0, 0, 0],
     [-y, 0, 0, 0, 0, 0, 0, 0, 0],
     [0, 0, 0, 0, 0, 0, 0, 0, 0],
     [-y, 0, 0, 0, 0, 0, 0, 0, 0]])

A_eigenvalues = A.eigenvals()
for a, b in A_eigenvalues.items():
    print(f'Собственное значение: {a}, кратность: {b}')
